# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
ch: 6
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, IN, []]  # 0
  - [-1, 1, Multiin, [1]]  # 1
  - [-2, 1, Multiin, [2]]  # 2

  # two stream backbone
  # Visible branch
  - [1, 1,  Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1,  Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 2, C3k2_PPA, [256, False, 0.25]]
  # Infrared branch
  - [2, 1,  Conv, [64, 3, 2 ] ] # 6-P1/2
  - [-1, 1, Conv, [128, 3, 2 ] ] # 7-P2/4
  - [-1, 2, C3k2_PPA, [256, False, 0.25]]

  - [-4, 1, Conv, [256, 3, 2]] # 9-P3/8
  - [-2, 1, Conv, [256, 3, 2]] # 10-P3/8  # infrared

    # 第一个DCF模块
  - [[-2, -1], 1, CPCA, [512, 256]]   # 11-P3/8 CPCA:Enhanced Features of visible branch with infrared branch
  - [[-3, 11], 1, FeatureFusionModule, []]       # 12-P3/8 stream one vis+Enhanced Features
  - [[-3, 11], 1, FeatureFusionModule, []]       # 13-P3/8 stream one inf+Enhanced Features

  - [-2, 2, C3k2_PPA, [512, False, 0.25]]
  - [-1, 1,  Conv, [512, 3, 2]] # 15-P4/16
  - [-3, 2, C3k2_PPA, [ 512, False, 0.25 ] ] # infrared
  - [-1, 1,  Conv, [ 512, 3, 2 ] ] # 17-P4/16

    # 第二个DCF模块
  - [[-3, -1], 1, CPCA, [1024, 512]]   # 18-P4/16 CPCA:Enhanced Features of visible branch with infrared branch
  - [[-4, 18], 1, FeatureFusionModule, []]       # 19-P4/16 stream one vis+Enhanced Features
  - [[-3, 18], 1, FeatureFusionModule, []]       # 20-P4/16 stream one inf+Enhanced Features

  - [-3, 2, C3k2_PPA, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 22-P5/32
  - [-3, 2, C3k2_PPA, [ 512, True ] ] # infrared
  - [-1, 1, Conv, [ 1024, 3, 2 ] ] # 24-P5/32

    # 第三个DCF模块
  - [[-3, -1], 1, CPCA, [2048, 1024]]   # 25-P5/32  CPCA:Enhanced Features of visible branch with infrared branch
  - [[-4, 25], 1, FeatureFusionModule, []]       # 26-P5/32  stream one vis+Enhanced Features
  - [[-3, 25], 1, FeatureFusionModule, []]       # 27-P5/32  stream one inf+Enhanced Features

  - [-3, 2, C3k2_PPA, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 29
  - [-1, 2, C2PSA, [1024]] # 30
  - [-4, 2, C3k2_PPA, [1024, True]] # infrared
  - [-1, 1, SPPF, [1024, 5]] # 32
  - [-1, 2, C2PSA, [1024]] # 33
    # FCF阶段
  - [[14, 16], 1, EnhancedCrossTransformerFusionV2, []]  # 34
  - [[21, 23], 1, EnhancedCrossTransformerFusionV2, []]  # 35
  - [[30, 33], 1, EnhancedCrossTransformerFusionV2, []]  # 36

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 35], 1, SBA, []] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 39

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 34], 1, SBA, []] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 42 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 39], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 45 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 36], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 48 (P5/32-large)

  - [[42, 45, 48], 1, Detect, [nc]] # Detect(P3, P4, P5)
